import { randomRange } from './math'
const middle = [
  '가창로221길',
  '경안로',
  '경안로45길',
  '경안로45안길',
  '고모로',
  '고모로18길',
  '고모로20길',
  '고모로22길',
  '고모로24길',
  '고모로26길',
  '고모로28길',
  '고모로33길',
  '고모로39길',
  '고모로41길',
  '고산로',
  '고산로4길',
  '고산로12길',
  '고산로18길',
  '고산로4안길',
  '공경로',
  '공경로2길',
  '공경로3길',
  '공경로5길',
  '공경로6길',
  '공경로7길',
  '교학로',
  '교학로2길',
  '교학로4길',
  '교학로5길',
  '교학로6길',
  '교학로7길',
  '교학로8길',
  '교학로11길',
  '교학로12길',
  '교학로16길',
  '교학로19길',
  '국채보상로',
  '국채보상로162길',
  '국채보상로164길',
  '국채보상로180길',
  '국채보상로186길',
  '국채보상로192길',
  '국채보상로194길',
  '국채보상로200길',
  '국채보상로202길',
  '국채보상로204길',
  '국채보상로205길',
  '국채보상로207길',
  '국채보상로209길',
  '국채보상로214길',
  '국채보상로216길',
  '국채보상로218길',
  '노변공원로',
  '노변공원로1길',
  '노변공원로3길',
  '노변공원로7길',
  '노변공원로13길',
  '노변로',
  '달구벌대로',
  '달구벌대로454길',
  '달구벌대로456길',
  '달구벌대로458길',
  '달구벌대로467길',
  '달구벌대로469길',
  '달구벌대로471길',
  '달구벌대로480길',
  '달구벌대로488길',
  '달구벌대로489길',
  '달구벌대로492길',
  '달구벌대로495길',
  '달구벌대로496길',
  '달구벌대로501길',
  '달구벌대로502길',
  '달구벌대로504길',
  '달구벌대로508길',
  '달구벌대로511길',
  '달구벌대로512길',
  '달구벌대로522길',
  '달구벌대로525길',
  '달구벌대로526길',
  '달구벌대로527길',
  '달구벌대로528길',
  '달구벌대로530길',
  '달구벌대로536길',
  '달구벌대로541길',
  '달구벌대로559길',
  '달구벌대로568길',
  '달구벌대로569길',
  '달구벌대로574길',
  '달구벌대로576길',
  '달구벌대로604길',
  '달구벌대로606길',
  '달구벌대로617길',
  '달구벌대로618길',
  '달구벌대로619길',
  '달구벌대로621길',
  '달구벌대로622길',
  '달구벌대로625길',
  '달구벌대로627길',
  '달구벌대로631길',
  '달구벌대로637길',
  '달구벌대로641길',
  '달구벌대로645길',
  '달구벌대로647길',
  '달구벌대로649길',
  '달구벌대로650길',
  '달구벌대로651길',
  '달구벌대로652길',
  '달구벌대로656길',
  '달구벌대로659길',
  '달구벌대로661길',
  '달구벌대로669길',
  '달구벌대로488안길',
  '달구벌대로489안길',
  '달구벌대로526안길',
  '동대구로',
  '동대구로3길',
  '동대구로6길',
  '동대구로7길',
  '동대구로8길',
  '동대구로12길',
  '동대구로14길',
  '동대구로15길',
  '동대구로20길',
  '동대구로25길',
  '동대구로29길',
  '동대구로38길',
  '동대구로41길',
  '동대구로42길',
  '동대구로45길',
  '동대구로46길',
  '동대구로48길',
  '동대구로49길',
  '동대구로50길',
  '동대구로52길',
  '동대구로54길',
  '동대구로55길',
  '동대구로56길',
  '동대구로57길',
  '동대구로58길',
  '동대구로59길',
  '동대구로73길',
  '동대구로74길',
  '동대구로77길',
  '동대구로80길',
  '동대구로12안길',
  '동대구로38안길',
  '동대구로74안길',
  '동원로',
  '동원로1길',
  '동원로2길',
  '동원로5길',
  '동원로6길',
  '동원로8길',
  '동원로11길',
  '동원로12길',
  '동원로28길',
  '들안로',
  '들안로1길',
  '들안로2길',
  '들안로8길',
  '들안로9길',
  '들안로13길',
  '들안로14길',
  '들안로16길',
  '들안로18길',
  '들안로19길',
  '들안로20길',
  '들안로25길',
  '들안로28길',
  '들안로29길',
  '들안로32길',
  '들안로33길',
  '들안로40길',
  '들안로42길',
  '들안로44길',
  '들안로46길',
  '들안로48길',
  '들안로50길',
  '들안로52길',
  '들안로54길',
  '들안로56길',
  '들안로60길',
  '들안로64길',
  '들안로67길',
  '들안로70길',
  '들안로71길',
  '들안로73길',
  '들안로77길',
  '들안로78길',
  '들안로81길',
  '들안로2안길',
  '들안로40안길',
  '들안로42안길',
  '만촌로',
  '만촌로1길',
  '만촌로3길',
  '만촌로4길',
  '만촌로5길',
  '만촌로8길',
  '만촌로12길',
  '만촌로14길',
  '만촌로20길',
  '만촌로24길',
  '만촌로26길',
  '만촌로28길',
  '만촌로32길',
  '명덕로',
  '명덕로73길',
  '명덕로75길',
  '명덕로76길',
  '명덕로76안길',
  '무열로',
  '무열로8길',
  '무열로11길',
  '무열로15길',
  '무열로19길',
  '무열로29길',
  '무열로39길',
  '무열로15안길',
  '무열로19안길',
  '무학로',
  '무학로11길',
  '무학로17길',
  '무학로21길',
  '무학로23길',
  '무학로27길',
  '무학로29길',
  '무학로31길',
  '무학로33길',
  '무학로35길',
  '무학로37길',
  '무학로21안길',
  '무학로37안길',
  '미술관로',
  '범안로',
  '범안로1길',
  '범안로2길',
  '범안로3길',
  '범안로4길',
  '범안로8길',
  '범안로16길',
  '범안로20길',
  '범안로60길',
  '범안로64길',
  '범안로65길',
  '범안로91길',
  '범안로3안길',
  '범안로4안길',
  '범어로',
  '범어로12길',
  '범어로16길',
  '범어로18길',
  '범어로19길',
  '범어로20길',
  '범어로24길',
  '범어로26길',
  '범어로27길',
  '범어로32길',
  '범어로34길',
  '범어천로',
  '상록로',
  '상록로2길',
  '상록로11길',
  '상록로16길',
  '상화로',
  '상화로1길',
  '상화로3길',
  '상화로4길',
  '상화로5길',
  '상화로7길',
  '성동로',
  '성동로15길',
  '성동로16길',
  '성동로33길',
  '성동로37길',
  '세진로',
  '세진로1길',
  '세진로3길',
  '세진로12길',
  '수성로',
  '수성로1길',
  '수성로5길',
  '수성로12길',
  '수성로14길',
  '수성로15길',
  '수성로19길',
  '수성로20길',
  '수성로23길',
  '수성로24길',
  '수성로25길',
  '수성로29길',
  '수성로32길',
  '수성로35길',
  '수성로37길',
  '수성로38길',
  '수성로39길',
  '수성로41길',
  '수성로43길',
  '수성로46길',
  '수성로50길',
  '수성로51길',
  '수성로52길',
  '수성로53길',
  '수성로54길',
  '수성로56길',
  '수성로57길',
  '수성로58길',
  '수성로60길',
  '수성로62길',
  '수성로64길',
  '수성로66길',
  '수성로68길',
  '수성로69길',
  '수성로70길',
  '수성로72길',
  '수성로74길',
  '수성로75길',
  '수성로76길',
  '수성로77길',
  '수성로39안길',
  '수성로50안길',
  '수성로52안길',
  '수성못길',
  '수성못2길',
  '수성못6길',
  '시지로',
  '시지로1길',
  '시지로3길',
  '시지로14길',
  '신매로',
  '신매로2길',
  '신매로4길',
  '신매로6길',
  '신매로8길',
  '신매로16길',
  '신매로19길',
  '신천대로',
  '신천동로',
  '신천동로22길',
  '신천동로26길',
  '신천동로34길',
  '신천동로46길',
  '신천동로48길',
  '신천동로52길',
  '신천동로62길',
  '신천동로84길',
  '신천동로86길',
  '신천동로88길',
  '신천동로96길',
  '신천동로98길',
  '신천동로86안길',
  '신천동쪽자전거길',
  '알파시티1로',
  '알파시티1로4길',
  '알파시티1로23길',
  '알파시티1로27길',
  '알파시티1로31길',
  '알파시티1로32길',
  '알파시티1로35길',
  '알파시티1로37길',
  '알파시티1로40길',
  '알파시티1로42길',
  '알파시티2로',
  '알파시티2로3길',
  '알파시티2로4길',
  '알파시티2로9길',
  '알파시티2로12길',
  '알파시티3로',
  '알파시티3로8길',
  '앞산터널로',
  '야구전설로',
  '용학로',
  '용학로25길',
  '용학로28길',
  '용학로30길',
  '용학로31길',
  '용학로33길',
  '용학로34길',
  '용학로35길',
  '용학로36길',
  '용학로40길',
  '용학로42길',
  '용학로44길',
  '용학로46길',
  '용학로48길',
  '용학로50길',
  '용학로25안길',
  '용학로31안길',
  '욱수길',
  '욱수천로',
  '월드컵로',
  '월드컵로5길',
  '월드컵로6길',
  '월드컵로5안길',
  '월드컵로6안길',
  '유니버시아드로',
  '유니버시아드로11길',
  '유니버시아드로42길',
  '유니버시아드로68길',
  '중앙고속도로',
  '지범로',
  '지범로1길',
  '지범로13길',
  '지범로17길',
  '지범로21길',
  '지범로22길',
  '지범로23길',
  '지범로25길',
  '지범로27길',
  '지범로29길',
  '지범로31길',
  '지범로39길',
  '지범로40길',
  '지범로41길',
  '지범로45길',
  '지범로46길',
  '지범로47길',
  '지범로48길',
  '지범로50길',
  '지범로52길',
  '지범로54길',
  '지범로31안길',
  '지산로',
  '지산로3길',
  '지산로9길',
  '지산로11길',
  '지산로13길',
  '지산로14길',
  '지산로14안길',
  '진밭길',
  '천을로',
  '천을로8길',
  '천을로23길',
  '천을로31길',
  '청솔로',
  '청솔로2길',
  '청솔로4길',
  '청솔로6길',
  '청솔로8길',
  '청솔로12길',
  '청솔로14길',
  '청솔로16길',
  '청솔로18길',
  '청솔로20길',
  '청솔로22길',
  '청수로',
  '청수로1길',
  '청수로3길',
  '청수로4길',
  '청수로9길',
  '청수로12길',
  '청수로20길',
  '청수로24길',
  '청수로25길',
  '청수로26길',
  '청수로29길',
  '청수로31길',
  '청수로34길',
  '청수로35길',
  '청수로36길',
  '청수로38길',
  '청수로40길',
  '청수로45길',
  '청호로',
  '청호로22길',
  '청호로46길',
  '청호로57길',
  '청호로67길',
  '청호로69길',
  '청호로76길',
  '청호로84길',
  '청호로85길',
  '청호로88길',
  '청호로92길',
  '청호로94길',
  '청호로95길',
  '청호로96길',
  '청호로84안길',
  '청호로85안길',
  '청호로88안길',
  '청호로96안길',
  '충의로',
  '충의로4길',
  '충의로6길',
  '충의로8길',
  '파동로',
  '파동로2길',
  '파동로3길',
  '파동로8길',
  '파동로12길',
  '파동로14길',
  '파동로16길',
  '파동로18길',
  '파동로22길',
  '파동로25길',
  '파동로26길',
  '파동로28길',
  '파동로30길',
  '파동로32길',
  '파동로37길',
  '파동로38길',
  '파동로40길',
  '파동로44길',
  '파동로46길',
  '파동로48길',
  '파동로51길',
  '파동로2안길',
  '파동로18안길',
  '팔현길',
  '화랑로',
  '화랑로2길',
  '화랑로8길',
  '화랑로12길',
  '화랑로32길',
  '화랑로34길',
  '화랑로36길',
  '화랑로38길',
  '화랑로40길',
  '화랑로42길',
  '효행로',
  '효행로2길',
  '희망로',
  '희망로19길',
  '희망로20길',
  '희망로21길',
  '희망로24길',
  '희망로30길',
  '희망로36길',
]
const address = [
  '서울특별시',

  '부산광역시',

  '인천광역시',

  '대구광역시',

  '대전광역시',

  '광주광역시',
  '울산광역시',

  '경기도 수원시',

  '경기도 고양시',

  '경기도 용인시',

  '경상남도 창원시',

  '경기도 성남시',

  '충청북도 청주시',

  '경기도 부천시',

  '경기도 화성시',

  '경기도 남양주시',

  '전라북도 전주시',

  '충청남도 천안시',

  '경기도 안산시',

  '경기도 안양시',

  '경상남도 김해시',

  '경기도 평택시',

  '경상북도 포항시',

  '제주특별자치도 제주시',

  '경기도 시흥시',

  '경기도 파주시',

  '경기도 의정부시',

  '경기도 김포시',

  '경상북도 구미시',

  '경기도 광주시',

  '경상남도 양산시',

  '강원도 원주시',

  '경상남도 진주시',

  '세종특별자치시',

  '경기도 광명시',

  '충청남도 아산시',

  '전라북도 익산시',

  '강원도 춘천시',

  '경상북도 경산시',

  '경기도 군포시',

  '전라북도 군산시',

  '경기도 하남시',

  '전라남도 여수시',

  '전라남도 순천시',

  '경상북도 경주시',

  '경상남도 거제시',

  '전라남도 목포시',

  '경기도 오산시',

  '경기도 이천시',

  '강원도 강릉시',

  '경기도 양주시',

  '충청북도 충주시',

  '경기도 안성시',

  '경기도 구리시',

  '충청남도 서산시',

  '제주특별자치도 서귀포시',

  '충청남도 당진시',

  '경상북도 안동시',

  '경기도 포천시',

  '경기도 의왕시',

  '전라남도 광양시',

  '경상북도 김천시',

  '충청북도 제천시',

  '경상남도 통영시',

  '충청남도 논산시',

  '경상북도 칠곡군',

  '경상남도 사천시',

  '경기도 여주시',

  '충청남도 공주시',

  '경기도 양평군',

  '전라북도 정읍시',

  '경상북도 영주시',

  '전라남도 나주시',

  '충청북도 음성군',

  '경상남도 밀양시',

  '충청남도 홍성군',

  '충청남도 보령시',

  '전라북도 완주군',

  '경상북도 상주시',

  '경상북도 영천시',

  '경기도 동두천시',

  '강원도 동해시',

  '전라북도 김제시',

  '전라남도 무안군',

  '전라북도 남원시',

  '충청북도 진천군',

  '충청남도 예산군',

  '강원도 속초시',

  '경상북도 문경시',

  '경상남도 함안군',

  '강원도 삼척시',

  '강원도 홍천군',

  '전라남도 해남군',

  '충청남도 부여군',

  '경상남도 창녕군',

  '충청남도 태안군',

  '전라남도 고흥군',

  '전라남도 화순군',

  '경상남도 거창군',

  '경기도 가평군',

  '전라남도 영암군',

  '충청남도 금산군',

  '전라북도 고창군',

  '경기도 과천시',

  '충청남도 서천군',

  '경상남도 고성군',

  '전라북도 부안군',

  '경상북도 의성군',

  '충청북도 옥천군',

  '전라남도 영광군',

  '충청북도 영동군',

  '경상북도 울진군',

  '전라남도 완도군',

  '경상북도 예천군',

  '강원도 철원군',

  '강원도 태백시',

  '경기도 연천군',

  '전라남도 담양군',

  '경상남도 합천군',

  '경상남도 하동군',

  '강원도 횡성군',

  '경상남도 남해군',

  '충청남도 계룡시',

  '전라남도 장성군',

  '경상북도 청도군',

  '경상북도 성주군',

  '강원도 평창군',

  '전라남도 보성군',

  '충청북도 괴산군',

  '경상남도 함양군',

  '충청북도 증평군',

  '강원도 영월군',

  '전라남도 장흥군',

  '경상북도 영덕군',

  '강원도 정선군',

  '전라남도 신안군',

  '경상남도 산청군',

  '전라남도 강진군',

  '경상북도 고령군',

  '충청북도 보은군',

  '충청남도 청양군',

  '경상북도 봉화군',

  '전라남도 함평군',

  '강원도 인제군',

  '전라남도 진도군',

  '전라남도 곡성군',

  '강원도 고성군',

  '충청북도 단양군',

  '전라북도 순창군',

  '전라북도 임실군',

  '경상남도 의령군',

  '강원도 양양군',

  '강원도 화천군',

  '경상북도 청송군',

  '전라남도 구례군',
  '전라북도 무주군',
  '전라북도 진안군',
  '강원도 양구군',
  '경상북도 군위군',
  '전라북도 장수군',
  '경상북도 영양군',
  '경상북도 울릉군',
]

const rand = ['', 0, '', 1, '', '', 2, '', 3, 4, '', 5, 6, '', 7, 8, '', 9]

export const randomAddress = () => {
  const firstNum = randomRange(rand) + randomRange(rand) + randomRange(rand)
  const lastNum = randomRange(rand)
  return (
    randomRange(address) +
    ' ' +
    randomRange(middle) +
    ' ' +
    firstNum +
    (firstNum && lastNum ? '-' + lastNum : '')
  )
}
